In [24]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [25]:


df_emp = pd.read_csv('employee_data.csv')
df_emp.head()

,EmployeeID,Name,Department,Salary,JoiningDate,PerformanceRating,Age,City
0,E001,John Doe,IT,75000,2020-01-15,4.5,28,New York
1,E002,Jane Smith,HR,60000,2019-03-22,4.2,32,Chicago
2,E003,Michael Brown,Finance,85000,2018-07-10,4.8,35,San Francisco
3,E004,Emily Davis,Marketing,62000,2021-05-05,3.9,26,New York
4,E005,Chris Wilson,IT,78000,2019-11-12,4.6,29,Chicago

In [26]:
total_salary = df_emp['Salary'].sum()
print(total_salary)

1447000

In [27]:
count_employee = df_emp['Department'].value_counts()
print(count_employee)

Department
IT           6
Finance      5
Marketing    5
HR           4
Name: count, dtype: int64

In [28]:
count_employee_city = df_emp['City'].value_counts()
print(count_employee_city)

City
New York         5
Chicago          5
San Francisco    5
Austin           5
Name: count, dtype: int64

In [29]:
df_emp['HighEarner'] = df_emp['Salary'] > 80000

In [30]:
df_emp

,EmployeeID,Name,Department,Salary,JoiningDate,PerformanceRating,Age,City,HighEarner
0,E001,John Doe,IT,75000,2020-01-15,4.5,28,New York,False
1,E002,Jane Smith,HR,60000,2019-03-22,4.2,32,Chicago,False
2,E003,Michael Brown,Finance,85000,2018-07-10,4.8,35,San Francisco,True
3,E004,Emily Davis,Marketing,62000,2021-05-05,3.9,26,New York,False
4,E005,Chris Wilson,IT,78000,2019-11-12,4.6,29,Chicago,False
5,E006,Sarah Johnson,Finance,90000,2017-09-01,4.9,38,San Francisco,True
6,E007,David Lee,HR,58000,2022-02-18,3.5,24,Austin,False
7,E008,Laura White,Marketing,65000,2020-08-30,4.1,27,Austin,False
8,E009,Robert Miller,IT,72000,2021-12-01,4.0,26,Chicago,False
9,E010,Jessica Taylor,Finance,82000,2019-06-15,4.4,31,New York,True
10,E011,Daniel Anderson,IT,80000,2018-04-20,4.7,33,San Francisco,False
11,E012,Lisa Thomas,HR,61000,2020-10-10,4.3,29,Austin,False
12,E013,James Jackson,Marketing,63000,2021-01-25,3.8,25,Chicago,False
13,E014,Karen Moore,Finance,88000,2017-11-05,4.8,36,New York,True
14,E015,Brian Martin,IT,76000,2020-05-14,4.2,28,Austin,False
15,E016,Nancy Garcia,HR,59000,2022-06-01,3.6,23,San Francisco,False
16,E017,George Martinez,Marketing,66000,2019-09-19,4.5,30,New York,False
17,E018,Betty Robinson,IT,79000,2018-12-12,4.6,34,Chicago,False
18,E019,Kevin Clark,Finance,84000,2020-03-03,4.3,32,Austin,True
19,E020,Sandra Rodriguez,Marketing,64000,2021-07-22,4.0,27,San Francisco,False

In [31]:
count_high_earner = df_emp['HighEarner'].value_counts()
print(count_high_earner)

HighEarner
False    15
True      5
Name: count, dtype: int64

In [32]:
average_age_per_def = df_emp.groupby('Department')['Age'].mean()
print(average_age_per_def)

Department
Finance      34.400000
HR           27.000000
IT           29.666667
Marketing    27.000000
Name: Age, dtype: float64

In [33]:
df_emp['JoiningDate'] = pd.to_datetime(df_emp['JoiningDate'])



print(df_emp)

   EmployeeID              Name Department  Salary JoiningDate  \
0        E001          John Doe         IT   75000  2020-01-15
1        E002        Jane Smith         HR   60000  2019-03-22
2        E003     Michael Brown    Finance   85000  2018-07-10
3        E004       Emily Davis  Marketing   62000  2021-05-05
4        E005      Chris Wilson         IT   78000  2019-11-12
5        E006     Sarah Johnson    Finance   90000  2017-09-01
6        E007         David Lee         HR   58000  2022-02-18
7        E008       Laura White  Marketing   65000  2020-08-30
8        E009     Robert Miller         IT   72000  2021-12-01
9        E010    Jessica Taylor    Finance   82000  2019-06-15
10       E011   Daniel Anderson         IT   80000  2018-04-20
11       E012       Lisa Thomas         HR   61000  2020-10-10
12       E013     James Jackson  Marketing   63000  2021-01-25
13       E014       Karen Moore    Finance   88000  2017-11-05
14       E015      Brian Martin         IT   76000  2020-05-14
15       E016      Nancy Garcia         HR   59000  2022-06-01
16       E017   George Martinez  Marketing   66000  2019-09-19
17       E018    Betty Robinson         IT   79000  2018-12-12
18       E019       Kevin Clark    Finance   84000  2020-03-03
19       E020  Sandra Rodriguez  Marketing   64000  2021-07-22

    PerformanceRating  Age           City  HighEarner
0                 4.5   28       New York       False
1                 4.2   32        Chicago       False
2                 4.8   35  San Francisco        True
3                 3.9   26       New York       False
4                 4.6   29        Chicago       False
5                 4.9   38  San Francisco        True
6                 3.5   24         Austin       False
7                 4.1   27         Austin       False
8                 4.0   26        Chicago       False
9                 4.4   31       New York        True
10                4.7   33  San Francisco       False
11                4.3   29         Austin       False
12                3.8   25        Chicago       False
13                4.8   36       New York        True
14                4.2   28         Austin       False
15                3.6   23  San Francisco       False
16                4.5   30       New York       False
17                4.6   34        Chicago       False
18                4.3   32         Austin        True
19                4.0   27  San Francisco       False

In [34]:
df_emp['BonusAmount'] = np.where(
    df_emp['PerformanceRating'] >= 4.5,
    df_emp['Salary'] * 0.1,
    0
)

In [35]:
print(df_emp)

   EmployeeID              Name Department  Salary JoiningDate  \
0        E001          John Doe         IT   75000  2020-01-15
1        E002        Jane Smith         HR   60000  2019-03-22
2        E003     Michael Brown    Finance   85000  2018-07-10
3        E004       Emily Davis  Marketing   62000  2021-05-05
4        E005      Chris Wilson         IT   78000  2019-11-12
5        E006     Sarah Johnson    Finance   90000  2017-09-01
6        E007         David Lee         HR   58000  2022-02-18
7        E008       Laura White  Marketing   65000  2020-08-30
8        E009     Robert Miller         IT   72000  2021-12-01
9        E010    Jessica Taylor    Finance   82000  2019-06-15
10       E011   Daniel Anderson         IT   80000  2018-04-20
11       E012       Lisa Thomas         HR   61000  2020-10-10
12       E013     James Jackson  Marketing   63000  2021-01-25
13       E014       Karen Moore    Finance   88000  2017-11-05
14       E015      Brian Martin         IT   76000  2020-05-14
15       E016      Nancy Garcia         HR   59000  2022-06-01
16       E017   George Martinez  Marketing   66000  2019-09-19
17       E018    Betty Robinson         IT   79000  2018-12-12
18       E019       Kevin Clark    Finance   84000  2020-03-03
19       E020  Sandra Rodriguez  Marketing   64000  2021-07-22

    PerformanceRating  Age           City  HighEarner  BonusAmount
0                 4.5   28       New York       False       7500.0
1                 4.2   32        Chicago       False          0.0
2                 4.8   35  San Francisco        True       8500.0
3                 3.9   26       New York       False          0.0
4                 4.6   29        Chicago       False       7800.0
5                 4.9   38  San Francisco        True       9000.0
6                 3.5   24         Austin       False          0.0
7                 4.1   27         Austin       False          0.0
8                 4.0   26        Chicago       False          0.0
9                 4.4   31       New York        True          0.0
10                4.7   33  San Francisco       False       8000.0
11                4.3   29         Austin       False          0.0
12                3.8   25        Chicago       False          0.0
13                4.8   36       New York        True       8800.0
14                4.2   28         Austin       False          0.0
15                3.6   23  San Francisco       False          0.0
16                4.5   30       New York       False       6600.0
17                4.6   34        Chicago       False       7900.0
18                4.3   32         Austin        True          0.0
19                4.0   27  San Francisco       False          0.0

In [37]:
salary_vs_rating = df_emp['Salary'].corr(df_emp['PerformanceRating'])
print(salary_vs_rating)

0.8216032356917855

In [ ]:
top_performer_per_city

In [ ]:
top_performer_per_city = df['']

In [ ]:
top_perfomer_per_city = 

print(top_perfomer_per_city)

City
Austin           20.4
Chicago          21.2
New York         22.1
San Francisco    22.0
Name: PerformanceRating, dtype: float64